liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/**
 ******************************************************************************
 * @file    cpp_main.cpp
 * @author  Georg Swoboda <cn@warp.at>
 * @date    21/09/2022
 * @version 2.0.0
 * @brief   COBS protocol bridge — replaces rosserial with direct COBS packets
 ******************************************************************************
 *
 * Migration from rosserial to COBS:
 *   - All ROS topic publish/subscribe removed
 *   - All ROS service servers/clients removed
 *   - ros::NodeHandle replaced by mowgli_comms COBS layer
 *   - USB CDC RX feeds mowgli_comms_process_rx() instead of ringbuffer
 *   - Packet send uses mowgli_comms_send_*() convenience wrappers
 *   - cmd_vel timeout uses HAL_GetTick() instead of nh.now()
 *
 ******************************************************************************
 */

#include "adc.h"
#include "board.h"
#include "main.h"

#include "blademotor.h"
#include "actuator_authorization.h"
#include "charger.h"
#include "drivemotor.h"
#include "emergency.h"
#include "blade_emergency_policy.hpp"
#include "heartbeat_emergency_policy.hpp"
#include "motor_output_safety.hpp"
#include "nbt.h"
#include "panel.h"
#include "pid.hpp"
#include "stm32f_board_hal.h"
#include "ultrasonic_sensor.h"
#include <cpp_main.h>

// USB CDC
#include "usbd_cdc_if.h"

// COBS protocol (replaces rosserial)
#include "mowgli_comms.h"
#include "mowgli_protocol.h"
#include "drive_tuning_defaults.h"
#include "fw_params.h"
#include "i2c.h"
#include "cmd_vel_safety.hpp"

// Math
#include <cmath>
#include <cstring>

// IMU
#include "imu/imu.h"

#ifdef OPTION_PERIMETER
#include "perimeter.h"
#endif

/* ---------------------------------------------------------------------------
 * Timer intervals
 * ---------------------------------------------------------------------------*/
/*
 * 10 ms (100 Hz) IMU rate. The MEMS sensor (LSM6DS33 / WT901 / LIS3MDL)
 * I2C read takes <1 ms, leaving plenty of CPU headroom in the 10 ms
 * window. At 115200 baud the additional ~50-byte IMU packet costs
 * ~4 ms wire time per second, so total serial usage stays comfortably
 * under the 11.5 KB/s budget alongside the existing 47 Hz odom and
 * 4 Hz status streams.
 */
#define IMU_NBT_TIME_MS 10
#define MOTORS_NBT_TIME_MS 20
#define STATUS_NBT_TIME_MS 250
#define PANEL_NBT_TIME_MS 100
#define LED_NBT_TIME_MS 1000
#define BLADE_NBT_TIME_MS 250

/* ---------------------------------------------------------------------------
 * Drive motor control state
 * ---------------------------------------------------------------------------*/
/* Target wheel velocities written by on_cmd_vel (ISR context) and read by
 * motors_handler() at MOTORS_NBT_TIME_MS cadence. Replaces the previous
 * "ISR writes PWM directly" path so motors_handler can run a wheel-level
 * PI loop using encoder feedback instead of forwarding an open-loop
 * cmd_vel × PWM_PER_MPS mapping. */
static volatile float left_target_mps = 0.0f;
static volatile float right_target_mps = 0.0f;

/* PWM ultimately sent to the PAC5210. Output of the PI loop in motors_handler;
 * legacy globals kept under the same names so the snapshot+watchdog logic
 * downstream is unchanged. */
static int16_t left_pwm_signed = 0;
static int16_t right_pwm_signed = 0;

/* ---------------------------------------------------------------------------
 * Wheel-level PI controller
 * ---------------------------------------------------------------------------
 * Brushed-DC motors driven by the PAC5210 have a hard static-friction
 * deadband (~PWM 40). Open-loop cmd_vel × PWM_PER_MPS produces PWM=2 for
 * a 0.05 m/s target — well below deadband, motors buzz, the chassis
 * doesn't move. We can't fix the motor physics but we CAN bridge the
 * deadband with closed-loop feedback: while the target says "move" and
 * the encoder says "stalled", the PI integrator ramps PWM up until the
 * motor breaks free, then settles around whatever PWM keeps the wheel
 * at target speed.
 *
 * Run at MOTORS_NBT_TIME_MS = 20 ms (50 Hz). Encoder feedback comes from
 * left_ticks_signed / right_ticks_signed (signed cumulative ticks
 * maintained by drivemotor.c, already direction-aware).
 *
 * Output = feedforward (target × PWM_PER_MPS, preserves the open-loop
 * behaviour above deadband) + Kp × error + integral_pwm. The integral is
 * stored pre-multiplied by Ki for trivial anti-windup.
 *
 * Set USE_WHEEL_PI to 0 to fall back to open-loop forwarding for
 * debugging / hardware bring-up. */
#define USE_WHEEL_PI 1
/* Power-on gains: drive_tuning_defaults.h. The live gains come from fw_params
 * (flash, then the host) — see apply_drive_params(). */
#define WHEEL_PI_DT_S (MOTORS_NBT_TIME_MS / 1000.0f)
/* Per-wheel velocity PI — battle-tested PX4 PID core (pid.hpp). Gains/limits
 * set once in init_ROS(). The integrator (kept inside the PID object) is what
 * bridges the static-friction deadband; output is the closed-loop PWM trim
 * added to the open-loop feedforward below. */
static PID left_wheel_pid;
static PID right_wheel_pid;
static int32_t prev_left_ticks_signed_pi = 0;
static int32_t prev_right_ticks_signed_pi = 0;
static float prev_left_target_mps = 0.0f;
static float prev_right_target_mps = 0.0f;

/* ---------------------------------------------------------------------------
 * Firmware-level anti-dig (task #46). ALWAYS active, in every mode, and
 * un-bypassable by any ROS controller: motors_handler drives the wheels for
 * docking, mowing AND transit alike (opennav_docking's cmd_vel arrives on the
 * same PKT_ID_CMD_VEL path), so cutting power here catches the "stuck wheels
 * keep spinning and dig holes in the lawn" failure that the FTC-level
 * anti-wheelspin (host, coverage-only) never sees. Per wheel: if it is
 * COMMANDED to move (|target| > MIN_TARGET) and the loop is actually PUSHING
 * (|PWM| > MIN_ABS_PWM — the PI integrator has wound past the deadband) but the
 * encoder logs LESS THAN PROGRESS_FRACTION of the travel the COMMANDED speed
 * implies over WINDOW_MS, latch the wheel OFF (force PWM 0) until the command
 * clears. Only ever REDUCES output.
 *
 * 2026-07-21: the test is now EXPECTED-vs-ACTUAL, not an absolute floor. The
 * old gate reset the window whenever the wheel travelled >= a fixed 0.03 m
 * within it, so a robot slowly PLOWING an obstacle (any creep above that floor,
 * trivially reachable on soft turf) reset forever and never latched -> it dug
 * continuously. Comparing actual travel to the distance the *commanded* speed
 * implies closes that loophole: a wheel plowing at a small fraction of its
 * command never clears PROGRESS_FRACTION and therefore latches, while a wheel
 * that keeps up with its command (any speed, any load) is left alone. The
 * fraction (not an absolute distance) is also self-scaling to the command, so a
 * slow legitimate dock creep at, say, 0.03 m/s is judged against 0.03 m/s of
 * expected travel — not against a fixed bar it would fail. */
#define ANTIDIG_WINDOW_MS 1500u          /* sustained plow/stall before cut [ms] (was 2500) */
#define ANTIDIG_MIN_TARGET_MPS 0.02f     /* below this the wheel isn't "commanded" */
#define ANTIDIG_MIN_ABS_PWM 60           /* below this it isn't really "pushing" (deadband ~40) */
#define ANTIDIG_PROGRESS_FRACTION 0.30f  /* latch if actual travel < 30% of commanded travel over the window */
static uint32_t l_dig_stall_ms = 0u;
static uint32_t r_dig_stall_ms = 0u;
static int32_t l_dig_stall_ticks = 0;     /* actual |ticks| accumulated over the window */
static int32_t r_dig_stall_ticks = 0;
static float l_dig_exp_ticks = 0.0f;      /* commanded-speed "expected" ticks over the window */
static float r_dig_exp_ticks = 0.0f;
static bool l_dig_latched = false;
static bool r_dig_latched = false;

/* Open-loop feedforward velocity->PWM scale. Runtime copy of the board.h
 * PWM_PER_MPS default, set from fw_params (FW_PARAM_PWM_PER_MPS). */
static volatile float g_pwm_per_mps = (float)PWM_PER_MPS;

