liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/* Forward declarations */
static void update_blade_led(void);

/* ---------------------------------------------------------------------------
 * Broadcast backpressure helpers
 * ---------------------------------------------------------------------------*/
static inline bool nbt_due(const nbt_t *nbt, const uint32_t now_tick) {
  return (now_tick - nbt->previousMillis) > nbt->timeout;
}

static inline void nbt_consume(nbt_t *nbt, const uint32_t now_tick) {
  nbt->previousMillis = now_tick;
}

static inline uint32_t usb_cdc_framed_packet_size(const size_t raw_packet_size) {
  /* All current packets are far below 254 bytes, so COBS adds at most one
   * overhead byte. Framed wire size = leading 0x00 + encoded payload + trailing
   * 0x00 <= raw + 3. */
  return (uint32_t)raw_packet_size + 3u;
}

static inline bool usb_cdc_can_queue_bytes(const uint32_t wire_bytes) {
  return CDC_TXQueue_GetWriteAvailable() >= wire_bytes;
}

static inline bool usb_cdc_should_send_telemetry_packet(
    const uint32_t wire_bytes) {
  if (!CDC_ShouldSendTelemetry()) {
    return false;
  }

  if (!usb_cdc_can_queue_bytes(wire_bytes)) {
    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_CDC_TX_QUEUE_FULL);
    return false;
  }

  return true;
}

/* ---------------------------------------------------------------------------
 * COBS packet handlers (Host -> Firmware)
 * ---------------------------------------------------------------------------*/

static void on_heartbeat(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_heartbeat_t) - 2u) {
    return;
  }

  const pkt_heartbeat_t *pkt = reinterpret_cast<const pkt_heartbeat_t *>(data);

  last_heartbeat_tick = HAL_GetTick();
  heartbeat_seen = 1u;

  const bool emergency_requested = pkt->emergency_requested != 0u;
  const bool emergency_release_requested =
      pkt->emergency_release_requested != 0u;
  const bool watchdog_latch_active =
      heartbeat_only_latch && Emergency_State() == 1u;
  /* A STOP request needs no sensor read: it always wins. This preserves the
   * previous sensor-read conditions for all other inputs. */
  const bool physical_emergency =
      !emergency_requested &&
      (watchdog_latch_active || emergency_release_requested) &&
      any_physical_emergency();
  const HeartbeatEmergencyDecision decision = decide_heartbeat_emergency(
      emergency_requested, emergency_release_requested, physical_emergency,
      watchdog_latch_active);

  switch (decision.action) {
    case HeartbeatEmergencyAction::Assert:
      Emergency_SetState(1);
      break;
    case HeartbeatEmergencyAction::Release:
      Emergency_SetState(0);
      break;
    case HeartbeatEmergencyAction::AutoClearWatchdog:
      Emergency_SetState(0);
      debug_printf("heartbeat resumed: comms-loss emergency auto-cleared\r\n");
      break;
    case HeartbeatEmergencyAction::Unchanged:
      break;
  }

  if (decision.clear_heartbeat_only_latch) {
    heartbeat_only_latch = false;
  }

  if (emergency_release_requested && !emergency_requested &&
      physical_emergency) {
    debug_printf("emergency release rejected: physical sensor still active\r\n");
  }
}

static void on_cmd_vel(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_cmd_vel_t) - 2u) {
    return;
  }

  const pkt_cmd_vel_t *pkt = reinterpret_cast<const pkt_cmd_vel_t *>(data);

  const float vx = pkt->linear_x;
  const float wz = pkt->angular_z;

  /* Firmware is the final safety authority.  Validate before refreshing the
   * watchdog: NaN defeats ordinary >/< clamps, and an invalid packet must
   * never preserve or refresh a motion target.  Clear all command state so a
   * malformed packet deterministically stops the next motor cycle. */
  mowgli_cmd_vel::SafetyState safety_state{
      cmd_wz, left_target_mps, right_target_mps, last_cmd_vel_tick};
  if (!mowgli_cmd_vel::apply_safety_for_mode(
          vx, wz, HAL_GetTick(),
          main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE, safety_state)) {
    cmd_wz = safety_state.cmd_wz;
    left_target_mps = safety_state.left_target_mps;
    right_target_mps = safety_state.right_target_mps;
    host_zero_motion_intent = safety_state.zero_motion_intent ? 1u : 0u;
    host_yaw_inhibit = 1u;
    valid_cmd_vel_seen = 0u;
    DRIVEMOTOR_SetHostZeroMotionIntent(1u);
    return;
  }

  const bool zero_motion = safety_state.zero_motion_intent;
  const bool idle = main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE;
  uint32_t accepted_authorization_epoch = 0u;
  const uint32_t authorization_primask = __get_PRIMASK();
  __disable_irq();
  const bool safety_boundary_active =
      mowgli_cmd_vel::authorization_boundary_active(
          idle, zero_motion, Emergency_State() != 0u);
  const bool drive_command_accepted =
      ActuatorAuthorization_AcceptDriveCommand(
          zero_motion, safety_boundary_active,
          &accepted_authorization_epoch);
  __set_PRIMASK(authorization_primask);
  if (!drive_command_accepted) {
    cmd_wz = 0.0f;
    left_target_mps = 0.0f;
    right_target_mps = 0.0f;
    host_zero_motion_intent = 1u;
    host_yaw_inhibit = 1u;
    valid_cmd_vel_seen = 0u;
    DRIVEMOTOR_SetHostZeroMotionIntent(1u);
    return;
  }

  if (idle) {
    /* A zero observed in IDLE satisfies only the fresh-zero re-arm phase.
     * The IDLE/emergency gates still hold the physical output at zero, and
     * this path must not make blade commands look fresh or extend motion TTL. */
    cmd_vel_authorization_epoch = accepted_authorization_epoch;
    cmd_wz = 0.0f;
    left_target_mps = 0.0f;
    right_target_mps = 0.0f;
    host_zero_motion_intent = 1u;
    host_yaw_inhibit = 1u;
    valid_cmd_vel_seen = 0u;
    DRIVEMOTOR_SetHostZeroMotionIntent(1u);
    if (target_blade_on_off == 0u) {
      ++host_zero_phase_sequence;
    }
    return;
  }

  /* Only a validated, currently authorized command is a new cmd_vel
   * heartbeat. The epoch is captured atomically with the zero re-arm. */
  cmd_vel_authorization_epoch = accepted_authorization_epoch;
  last_cmd_vel_tick = safety_state.last_valid_tick;
  valid_cmd_vel_seen = 1u;
  host_zero_motion_intent = zero_motion ? 1u : 0u;
  host_yaw_inhibit = safety_state.yaw_inhibited ? 1u : 0u;
  DRIVEMOTOR_SetHostZeroMotionIntent(zero_motion ? 1u : 0u);

  /* Commanded yaw rate for the firmware yaw-rate loop (Option C), read in the
   * motor timebase by motors_handler. Stored raw (pre-IK) so the loop tracks
   * the operator/Nav2 intent, not the clamped per-wheel reconstruction. */
  cmd_wz = wz;

