liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
  /* Differential-drive inverse kinematics — per-wheel linear speed. Wheel base
   * and the ±cap are runtime parameters (FW_PARAM_WHEEL_BASE/FW_PARAM_MAX_MPS);
   * compile-time WHEEL_BASE/MAX_MPS remain the power-on fallback. The cap can
   * only be lowered below the compiled MAX_MPS ceiling. */
  const float wheel_base = g_wheel_base;
  const float max_mps = DRIVEMOTOR_GetMaxMps();
  float left_mps = vx - wz * wheel_base * 0.5f;
  float right_mps = vx + wz * wheel_base * 0.5f;

  if (left_mps > max_mps)
    left_mps = max_mps;
  if (left_mps < -max_mps)
    left_mps = -max_mps;
  if (right_mps > max_mps)
    right_mps = max_mps;
  if (right_mps < -max_mps)
    right_mps = -max_mps;

  /* Hand the target wheel velocities to the PI loop in motors_handler.
   * The mapping to PWM (feedforward + closed-loop correction) lives
   * there now so the integrator can bridge the static-friction
   * deadband on sub-deadband commands. */
  left_target_mps = left_mps;
  right_target_mps = right_mps;
  if (zero_motion && target_blade_on_off == 0u) {
    ++host_zero_phase_sequence;
  }
}

/* ---------------------------------------------------------------------------
 * Runtime parameters (protocol v7). Handlers run in USB RX interrupt context:
 * they only store the coerced value (fw_params_set). The subsystems are updated
 * from the main loop by apply_param_groups(), one group at a time, so no loop
 * ever sees a half-applied set.
 * ---------------------------------------------------------------------------*/
static void on_set_param(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_set_param_t) - 2u) {
    return;
  }
  pkt_set_param_t pkt;
  memcpy(&pkt, data, sizeof(pkt) - 2u);
  (void)fw_params_set(pkt.param_id, pkt.value);
}

static void on_get_param(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_get_param_t) - 2u) {
    return;
  }
  pkt_get_param_t pkt;
  memcpy(&pkt, data, sizeof(pkt) - 2u);
  fw_params_request_report(pkt.param_id);
}

static void on_param_commit(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_param_commit_t) - 2u) {
    return;
  }
  if (data[1] == PKT_PARAM_COMMIT_MAGIC) {
    fw_params_request_commit();
  }
}

/* Per-wheel velocity PI + encoder scale + feedforward. Both wheels share the
 * gains; the output limit stays 255 PWM (motor controller max) and is
 * re-asserted so it never depends on init order (the PX4 PID default-inits
 * _limit_output to 0). */
static void apply_drive_params() {
  const float kp = fw_params_get(FW_PARAM_WHEEL_KP);
  const float ki = fw_params_get(FW_PARAM_WHEEL_KI);
  const float kd = fw_params_get(FW_PARAM_WHEEL_KD);
  const float ilim = fw_params_get(FW_PARAM_WHEEL_INTEGRAL_LIMIT);
  left_wheel_pid.setGains(kp, ki, kd);
  left_wheel_pid.setIntegralLimit(ilim);
  left_wheel_pid.setOutputLimit(255.0f);
  right_wheel_pid.setGains(kp, ki, kd);
  right_wheel_pid.setIntegralLimit(ilim);
  right_wheel_pid.setOutputLimit(255.0f);
  DRIVEMOTOR_SetTicksPerMeter(fw_params_get(FW_PARAM_TICKS_PER_METER));
  g_pwm_per_mps = fw_params_get(FW_PARAM_PWM_PER_MPS);
}

/* Gyro yaw-rate loop. The trim limit is also capped to the live speed cap,
 * and the integral limit is pinned below it so the integrator alone can never
 * exceed the differential clamp. */
static void apply_yaw_params() {
  const float tl = pid_constrain(fw_params_get(FW_PARAM_YAW_TRIM_LIMIT_MPS), 0.0f,
                                 DRIVEMOTOR_GetMaxMps());
  yaw_pid.setGains(fw_params_get(FW_PARAM_YAW_KP), fw_params_get(FW_PARAM_YAW_KI), 0.0f);
  yaw_pid.setIntegralLimit(tl * YAW_INT_LIMIT_FRAC);
  yaw_pid.setOutputLimit(tl);
  g_yaw_trim_limit_mps = tl;
  g_yaw_gyro_sign = fw_params_get(FW_PARAM_YAW_GYRO_SIGN) < 0.0f ? -1.0f : 1.0f;
  g_yaw_gyro_bias = fw_params_get(FW_PARAM_YAW_GYRO_BIAS_RADPS);
  g_yaw_loop_enabled = fw_params_get(FW_PARAM_YAW_LOOP_ENABLED) != 0.0f ? 1u : 0u;
}

static void apply_kinematics_params() {
  /* on_cmd_vel (USB interrupt) reads both: update them together. */
  __disable_irq();
  DRIVEMOTOR_SetMaxMps(fw_params_get(FW_PARAM_MAX_MPS));
  g_wheel_base = fw_params_get(FW_PARAM_WHEEL_BASE);
  __enable_irq();
}

static void apply_charge_params() {
  charger_set_charge_limits(fw_params_get(FW_PARAM_MAX_CHARGE_VOLTAGE),
                            fw_params_get(FW_PARAM_MAX_CHARGE_CURRENT));
}

static void apply_emergency_params() {
  emergency_set_timeouts((uint32_t)fw_params_get(FW_PARAM_ONE_WHEEL_LIFT_MS),
                         (uint32_t)fw_params_get(FW_PARAM_BOTH_WHEELS_LIFT_MS),
                         (uint32_t)fw_params_get(FW_PARAM_TILT_MS),
                         (uint32_t)fw_params_get(FW_PARAM_STOP_BUTTON_MS),
                         (uint32_t)fw_params_get(FW_PARAM_PLAY_CLEAR_MS));
}

static void apply_imu_params() {
  /* Queued: I2C_Onboard_Service rewrites the LIS3DH register from its own
   * state machine, never mid-transaction. */
  I2C_Onboard_SetInclinationThreshold(
      (uint8_t)fw_params_get(FW_PARAM_IMU_INCLINATION_THRESHOLD));
}

static void apply_param_groups(uint32_t groups) {
  if (groups & (1u << FW_PARAM_GROUP_DRIVE)) {
    apply_drive_params();
  }
  if (groups & (1u << FW_PARAM_GROUP_KINEMATICS)) {
    apply_kinematics_params();
  }
  /* The yaw trim is capped by max_mps: re-apply it when the cap moves. */
  if (groups & ((1u << FW_PARAM_GROUP_YAW) | (1u << FW_PARAM_GROUP_KINEMATICS))) {
    apply_yaw_params();
  }
  if (groups & (1u << FW_PARAM_GROUP_CHARGE)) {
    apply_charge_params();
  }
  if (groups & (1u << FW_PARAM_GROUP_EMERGENCY)) {
    apply_emergency_params();
  }
  if (groups & (1u << FW_PARAM_GROUP_IMU)) {
    apply_imu_params();
  }
}

static void on_hl_state(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_hl_state_t) - 2u) {
    return;
  }

  const pkt_hl_state_t *pkt = reinterpret_cast<const pkt_hl_state_t *>(data);
  const bool was_idle = main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE;

  hl_current_mode = pkt->current_mode;
  hl_gps_quality = pkt->gps_quality;

  // Update panel LEDs based on mode
  if (hl_gps_quality < 90) {
    PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_OFF);
  } else {
    PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_ON);
  }

  // Map host mode to internal status for motor safety.
  // Constants defined in mowgli_protocol.h — keep in sync with
  // HighLevelStatus.msg.
  switch (hl_current_mode) {
  case HL_MODE_AUTONOMOUS:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_ON);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_OFF);
    main_eOpenmowerStatus = OPENMOWER_STATUS_MOWING;
    break;
  case HL_MODE_RECORDING:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_ON);
    main_eOpenmowerStatus = OPENMOWER_STATUS_RECORD;
    break;
  case HL_MODE_MANUAL_MOWING:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_ON);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_ON);
    main_eOpenmowerStatus = OPENMOWER_STATUS_MOWING;
    break;
  case HL_MODE_NULL:
  case HL_MODE_IDLE:
  default:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_4H, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_6H, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_8H, PANEL_LED_OFF);
    if (!was_idle) {
      ActuatorAuthorization_Invalidate();
    }
    main_eOpenmowerStatus = OPENMOWER_STATUS_IDLE;
    left_target_mps = right_target_mps = 0.0f;
    /* IDLE invalidates the controller's already prepared UART speeds too. A
     * rapid later mode change still needs a fresh post-IDLE cmd_vel. */
    DRIVEMOTOR_SetHostZeroMotionIntent(1u);
    DRIVEMOTOR_SetSpeedSigned(0, 0, ActuatorAuthorization_Epoch());
    cmd_wz = 0.0f;
    blade_on_off = target_blade_on_off = 0;
    target_blade_authorization_epoch = ActuatorAuthorization_Epoch();
    valid_cmd_vel_seen = 0u;
    host_zero_motion_intent = 1u;
    host_yaw_inhibit = 1u;
    break;
  }

  update_blade_led();
}

