liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
static void on_cmd_blade(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_cmd_blade_t) - 2u) {
    return;
  }

  const pkt_cmd_blade_t *pkt = reinterpret_cast<const pkt_cmd_blade_t *>(data);
  /* Bind each explicit request to the emergency generation it followed.
   * Commands received during an emergency are rejected by the shared policy. */
  const uint32_t primask = __get_PRIMASK();
  __disable_irq();
  const uint32_t emergency_generation = ActuatorAuthorization_Epoch();
  const bool emergency_active = Emergency_State() != 0u;
  const bool blade_command_fresh = blade_on_command_is_fresh(
      HAL_GetTick(), last_cmd_vel_tick, valid_cmd_vel_seen != 0u,
      CMD_VEL_TIMEOUT_MS, last_heartbeat_tick, heartbeat_seen != 0u,
      HEARTBEAT_TIMEOUT_MS) &&
      ActuatorAuthorization_DriveRequestIsCurrent(
          cmd_vel_authorization_epoch);
  const std::uint8_t accepted_blade_request =
      pkt->blade_on != 0u && !blade_command_fresh ? 0u : pkt->blade_on;
  const BladeIntentDecision decision = decide_blade_intent(
      target_blade_on_off, target_blade_authorization_epoch, true,
      accepted_blade_request, emergency_generation,
      main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE, emergency_active,
      motor_link_rearm_required != 0u,
      emergency_generation);
  target_blade_on_off = decision.retained_request;
  target_blade_authorization_epoch = decision.request_generation;
  blade_direction = pkt->blade_dir;
  if (pkt->blade_on == 0u && host_zero_motion_intent != 0u &&
      left_target_mps == 0.0f && right_target_mps == 0.0f &&
      main_eOpenmowerStatus != OPENMOWER_STATUS_IDLE) {
    ++host_zero_phase_sequence;
  }
  __set_PRIMASK(primask);
}

/* Host -> Firmware reboot request. Sets reboot_flag so chatter_handler issues
 * NVIC_SystemReset on its next tick (lets the current packet/ISR unwind first).
 * Gated on the magic byte so a corrupt/misframed packet can't reset the board.
 */
static void on_reboot(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_reboot_t) - 2u) {
    return;
  }
  const pkt_reboot_t *pkt = reinterpret_cast<const pkt_reboot_t *>(data);
  if (pkt->magic == PKT_REBOOT_MAGIC) {
    debug_printf("reboot requested by host\r\n");
    reboot_flag = true;
  }
}

/* Host -> Firmware config/version request. Replies with this firmware's
 * wire-protocol version (the compatibility key the host checks) and its
 * human-readable semver, so the ROS 2 image can confirm it is talking to a
 * compatible firmware and warn the operator to reflash on mismatch. Firmware
 * older than this handshake never registers this handler, so it simply never
 * replies — which the host reads as "incompatible firmware". */
static void on_config_req(const uint8_t *data, size_t len) {
  if (len < 1u) {
    return;
  }
  const uint8_t flags = (len >= 2u) ? data[1] : 0u;
  g_firmware_debug_enabled = (flags & CONFIG_FLAG_FIRMWARE_DEBUG) != 0u ? 1u : 0u;

  pkt_config_rsp_t rsp;
  rsp.type = PKT_ID_CONFIG_RSP;
  rsp.protocol_version = MOWGLI_PROTOCOL_VERSION;
  rsp.active_flags = g_firmware_debug_enabled != 0u ? CONFIG_FLAG_FIRMWARE_DEBUG : 0u;
  rsp.fw_version_major = MOWGLI_FW_VERSION_MAJOR;
  rsp.fw_version_minor = MOWGLI_FW_VERSION_MINOR;
  rsp.fw_version_patch = MOWGLI_FW_VERSION_PATCH;
  mowgli_comms_send(&rsp, sizeof(rsp));
}

/* on_hl_state blade LED feedback (moved out of on_hl_state for clarity) */
static void update_blade_led(void) {
  if (target_blade_on_off) {
#ifdef PANEL_LED_2H
    if (BLADEMOTOR_bActivated) {
      PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_FLASH_SLOW);
    } else {
      PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_ON);
    }
#endif
  } else {
#ifdef PANEL_LED_2H
    PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_OFF);
#endif
  }
}

/* ---------------------------------------------------------------------------
 * USB CDC receive callback — feeds COBS layer
 * ---------------------------------------------------------------------------*/
uint8_t CDC_DataReceivedHandler(const uint8_t *Buf, uint32_t len) {
  WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_CDC_RX_PROCESS);
  mowgli_comms_process_rx(Buf, (size_t)len);
  WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_CDC_RX_EXIT);
  return CDC_RX_DATA_HANDLED;
}

/* ---------------------------------------------------------------------------
 * usb_cdc_transmit — required by mowgli_comms.c
 * ---------------------------------------------------------------------------*/
void usb_cdc_transmit(const uint8_t *buf, size_t len) {
  CDC_Transmit(buf, (uint32_t)len);
}

/* ---------------------------------------------------------------------------
 * LED blink + reboot handler (replaces chatter_handler)
 * ---------------------------------------------------------------------------*/
extern "C" void chatter_handler() {
  if (NBT_handler(&led_nbt)) {
    HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_PIN);

    if (reboot_flag) {
      NVIC_SystemReset();
    }
  }
}

/* Anti-dig per-wheel step (task #46). Returns true when the wheel must be cut
 * (caller forces PWM 0 + resets that wheel's integrator). Over each window it
 * accumulates BOTH the actual travel (|dticks|) AND the travel the commanded
 * speed implies (|target| × ticks_per_meter × dt); at window end it latches iff
 * the wheel kept less than PROGRESS_FRACTION of that commanded travel while
 * pushing. Comparing to the *command* (not a fixed distance) means a wheel that
 * keeps up with its setpoint — fast or slow, light or heavy load — is never
 * flagged, while a wheel PLOWING at a small fraction of its command latches
 * even if its absolute creep is non-trivial (the loophole in the old fixed-
 * 0.03 m floor, which reset forever on any creep above it). Clears the latch
 * the instant the command drops below MIN_TARGET.
 *
 * MANUAL FIELD TEST (supervised, 2026-07-21 — no host test harness for this
 * TU): 1) On turf, command a straight drive into a fixed obstacle (wall/post)
 * so both wheels stall while cmd_vel keeps requesting ~0.15 m/s. Expect BOTH
 * wheels to cut within ~WINDOW_MS (~1.5 s) — verify no continued grinding.
 * 2) Back off; confirm the latch clears (wheels drive again) once cmd_vel
 * returns to ~0. 3) Regression: a full normal mow + a slow dock approach must
 * NOT trip the latch (heavy grass load and slope climbing keep >30% of the
 * commanded travel). 4) Half-block ONE wheel (e.g. against a low kerb) and
 * confirm only that wheel latches. */
static bool antidig_step(uint32_t *stall_ms, int32_t *stall_ticks,
                         float *exp_ticks, bool *latched, float target,
                         int16_t pwm, int32_t dticks, float ticks_per_meter) {
  const bool commanded = fabsf(target) > ANTIDIG_MIN_TARGET_MPS;
  if (!commanded) {
    *stall_ms = 0u;
    *stall_ticks = 0;
    *exp_ticks = 0.0f;
    *latched = false;
    return false;
  }
  if (*latched) {
    return true; /* hold until the command clears (handled above) */
  }
  const bool pushing = (pwm > ANTIDIG_MIN_ABS_PWM) || (pwm < -ANTIDIG_MIN_ABS_PWM);
  if (!pushing) {
    *stall_ms = 0u;
    *stall_ticks = 0;
    *exp_ticks = 0.0f;
    return false;
  }
  *stall_ms += MOTORS_NBT_TIME_MS;
  *stall_ticks += (dticks < 0) ? -dticks : dticks;
  *exp_ticks += fabsf(target) * ticks_per_meter * WHEEL_PI_DT_S;
  if (*stall_ms >= ANTIDIG_WINDOW_MS) {
    if ((float)(*stall_ticks) < ANTIDIG_PROGRESS_FRACTION * (*exp_ticks)) {
      *latched = true; /* pushed the whole window, kept <30% of commanded travel → dig */
    } else {
      *stall_ms = 0u; /* keeping up with the command — reset the window */
      *stall_ticks = 0;
      *exp_ticks = 0.0f;
    }
  }
  return *latched;
}

/* ---------------------------------------------------------------------------
 * Drive & blade motors handler
 * ---------------------------------------------------------------------------*/
extern "C" void motors_handler() {
  if (NBT_handler(&motors_nbt)) {
    /* Snapshot ISR-written variables under interrupt lock */
    __disable_irq();
    float snap_left_target = left_target_mps;
    float snap_right_target = right_target_mps;
    float snap_cmd_wz = cmd_wz;
    uint8_t snap_target_blade = target_blade_on_off;
    uint32_t snap_blade_generation = target_blade_authorization_epoch;
    uint32_t snap_cmd_vel = last_cmd_vel_tick;
    uint32_t snap_cmd_vel_authorization_epoch = cmd_vel_authorization_epoch;
    uint32_t snap_zero_phase = host_zero_phase_sequence;
    bool snap_zero_intent = host_zero_motion_intent != 0u;
    bool snap_yaw_inhibit = host_yaw_inhibit != 0u;
    float snap_ticks_per_meter = DRIVEMOTOR_GetTicksPerMeter();
    uint32_t snap_emergency_generation = ActuatorAuthorization_Epoch();
    bool emergency_active = Emergency_State() != 0u;
    bool idle = main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE;
    bool links_healthy = DRIVEMOTOR_FeedbackHealthy() &&
                         BLADEMOTOR_FeedbackHealthy();
    uint32_t drive_fault_sequence = DRIVEMOTOR_FaultSequence();
    uint32_t blade_fault_sequence = BLADEMOTOR_FaultSequence();
    bool link_inhibited = MOTORLINK_OutputInhibited() != 0u;
    __enable_irq();

    const bool cmd_vel_authorization_current =
        ActuatorAuthorization_DriveRequestIsCurrent(
            snap_cmd_vel_authorization_epoch);

    const bool link_rearm_was_required = motor_link_rearm_required != 0u;
    motor_link_rearm_required = mowgli_motor_safety::update_link_rearm(
        motor_link_rearm_state, links_healthy, snap_zero_phase,
        snap_zero_intent, snap_target_blade == 0u, drive_fault_sequence,
        blade_fault_sequence, link_inhibited);
    if (motor_link_rearm_required != 0u) {
      MOTORLINK_ForceInhibit();
    } else if (mowgli_motor_safety::link_rearm_clear_transition(
                   link_rearm_was_required,
                   motor_link_rearm_required != 0u)) {
      /* Close the race with a UART fault or a host update between the snapshot
       * and inhibit clear, but only on the required -> armed transition.
       * Once armed, normal drive/blade requests must not be treated as a new
       * re-arm failure; link faults are detected by update_link_rearm and the
       * final output gate below. */
      const uint32_t primask = __get_PRIMASK();
      __disable_irq();
      const bool still_healthy = DRIVEMOTOR_FeedbackHealthy() &&
                                 BLADEMOTOR_FeedbackHealthy() &&
          DRIVEMOTOR_FaultSequence() == drive_fault_sequence &&
          BLADEMOTOR_FaultSequence() == blade_fault_sequence &&
          host_zero_phase_sequence == snap_zero_phase &&
          host_zero_motion_intent != 0u && target_blade_on_off == 0u &&
          left_target_mps == 0.0f && right_target_mps == 0.0f &&
          Emergency_State() == 0u &&
          ActuatorAuthorization_DriveRequestIsCurrent(
              cmd_vel_authorization_epoch);
      if (still_healthy) {
        MOTORLINK_ClearInhibit();
      } else {
        motor_link_rearm_required = 1u;
        motor_link_rearm_state.required = true;
        motor_link_rearm_state.zero_phase_baseline = host_zero_phase_sequence;
        MOTORLINK_ForceInhibit();
      }
      __set_PRIMASK(primask);
    }

    /* Emergency and IDLE gates discard retained blade intent as well as
     * forcing the output OFF, so clearing a gate cannot revive an older
     * enable request. */
    const BladeIntentDecision blade_decision = decide_blade_intent(
        snap_target_blade, snap_blade_generation, false, 0u,
        snap_emergency_generation, idle, emergency_active,
        motor_link_rearm_required != 0u, snap_emergency_generation);
    blade_on_off = blade_decision.effective_output;
    if (blade_decision.retained_request != snap_target_blade ||
        blade_decision.request_generation != snap_blade_generation) {
      const uint32_t primask = __get_PRIMASK();
      __disable_irq();
      const uint32_t current_generation = ActuatorAuthorization_Epoch();
      const bool emergency_active_now = Emergency_State() != 0u;
      const bool idle_now = main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE;
      if (target_blade_on_off != 0u &&
          (emergency_active_now || idle_now ||
           motor_link_rearm_required != 0u ||
           target_blade_authorization_epoch != current_generation)) {
        target_blade_on_off = 0;
        target_blade_authorization_epoch = current_generation;
      }
      __set_PRIMASK(primask);
    }

