liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
    if (buttonupdated == 1 && buttoncleared == 0) {
      const uint32_t ui_event_wire_bytes =
          usb_cdc_framed_packet_size(sizeof(pkt_ui_event_t));
      pkt_ui_event_t evt;
      evt.type = PKT_ID_UI_EVENT;
      evt.press_duration = 0; // short press

      // Map physical buttons to IDs
      if (buttonstate[PANEL_BUTTON_DEF_S1]) {
        evt.button_id = 1;
        if (usb_cdc_should_send_telemetry_packet(ui_event_wire_bytes)) {
          mowgli_comms_send(&evt, sizeof(evt));
        }
      }
      if (buttonstate[PANEL_BUTTON_DEF_S2]) {
        evt.button_id = 2;
        if (usb_cdc_should_send_telemetry_packet(ui_event_wire_bytes)) {
          mowgli_comms_send(&evt, sizeof(evt));
        }
      }
      if (buttonstate[PANEL_BUTTON_DEF_LOCK]) {
        evt.button_id = 3;
        if (usb_cdc_should_send_telemetry_packet(ui_event_wire_bytes)) {
          mowgli_comms_send(&evt, sizeof(evt));
        }
      }
      if (buttonstate[PANEL_BUTTON_DEF_START]) {
        evt.button_id = 4;
        if (usb_cdc_should_send_telemetry_packet(ui_event_wire_bytes)) {
          mowgli_comms_send(&evt, sizeof(evt));
        }
      }
      if (buttonstate[PANEL_BUTTON_DEF_HOME]) {
        evt.button_id = 5;
        if (usb_cdc_should_send_telemetry_packet(ui_event_wire_bytes)) {
          mowgli_comms_send(&evt, sizeof(evt));
        }
      }

      buttonupdated = 0;
    }
  }
}

#if OPTION_ULTRASONIC == 1
extern "C" void ultrasonic_handler(void) {
  // USS data is included in the status packet — no separate packet needed.
  // This handler is kept for the main loop call in main.c.
}
#endif

/* ---------------------------------------------------------------------------
 * Wheel ticks handler — called from DRIVEMOTOR_App_Rx() every 20 ms.
 *
 * Builds the odometry packet from signed cumulative ticks. Per-wheel
 * velocity is computed here (not on the Pi) because the firmware has the
 * hardware-timer-accurate dt. All four quantities in the packet are
 * signed; the host doesn't need a direction byte or to re-sign anything.
 * ---------------------------------------------------------------------------*/
extern "C" void
wheelTicks_handler(int32_t p_s32LeftTicksSigned, int32_t p_s32RightTicksSigned,
                   int16_t p_s16LeftSpeed, /* currently unused — reserved for
                                              future telemetry */
                   int16_t p_s16RightSpeed) {
  (void)p_s16LeftSpeed;
  (void)p_s16RightSpeed;

  static int32_t prev_left_ticks = 0;
  static int32_t prev_right_ticks = 0;

  const uint32_t now_tick = HAL_GetTick();
  const uint16_t dt_ms = (uint16_t)(now_tick - last_odom_tick);
  last_odom_tick = now_tick;

  const int32_t delta_left = p_s32LeftTicksSigned - prev_left_ticks;
  const int32_t delta_right = p_s32RightTicksSigned - prev_right_ticks;
  prev_left_ticks = p_s32LeftTicksSigned;
  prev_right_ticks = p_s32RightTicksSigned;

  /* Velocity: mm/s = (delta_ticks / ticks_per_meter) * (1000 / dt_ms) * 1000
   *                = delta_ticks * 1e6 / (ticks_per_meter * dt_ms).
   * ticks_per_meter starts from board.h TICKS_PER_M, then the ROS host can
   * override it at runtime. Use float math here so fractional tuning values
   * (e.g. 319.305) survive end-to-end. */
  int16_t left_v_mm_s = 0;
  int16_t right_v_mm_s = 0;
  if (dt_ms > 0) {
    const float ticks_per_meter = DRIVEMOTOR_GetTicksPerMeter();
    const float scale = 1000000.0f / (ticks_per_meter * (float)dt_ms);
    int32_t v_l = (int32_t)((float)delta_left * scale);
    int32_t v_r = (int32_t)((float)delta_right * scale);
    if (v_l > 32767)
      v_l = 32767;
    if (v_l < -32768)
      v_l = -32768;
    if (v_r > 32767)
      v_r = 32767;
    if (v_r < -32768)
      v_r = -32768;
    left_v_mm_s = (int16_t)v_l;
    right_v_mm_s = (int16_t)v_r;
  }

  pkt_odometry_t odom;
  odom.type = PKT_ID_ODOMETRY;
  odom.dt_millis = dt_ms;
  odom.left_ticks = p_s32LeftTicksSigned;
  odom.right_ticks = p_s32RightTicksSigned;
  odom.left_velocity_mm_s = left_v_mm_s;
  odom.right_velocity_mm_s = right_v_mm_s;

  if (usb_cdc_should_send_telemetry_packet(
          usb_cdc_framed_packet_size(sizeof(pkt_odometry_t)))) {
    mowgli_comms_send_odometry(&odom);
  }
}

/* ---------------------------------------------------------------------------
 * IMU + status broadcast handler
 * ---------------------------------------------------------------------------*/
extern "C" void broadcast_handler() {
  WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_ENTER);
  const uint32_t now_tick = HAL_GetTick();

  /* Bound this section to one broadcast group per pass. Without that bound a
   * delayed loop can emit IMU + reset/status + blade packets back-to-back in
   * the same WATCHDOG_STAGE_BROADCAST window. The USB CDC enqueue path is
   * non-blocking, but building and queueing several packets in one pass still
   * stretches the watchdog window unnecessarily when USB is backpressured. */
  if (nbt_due(&status_nbt, now_tick)) {
    const uint32_t status_group_bytes =
        usb_cdc_framed_packet_size(sizeof(pkt_reset_cause_t)) +
        usb_cdc_framed_packet_size(sizeof(pkt_status_t));
    if (!usb_cdc_should_send_telemetry_packet(status_group_bytes)) {
      WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_EXIT);
      return;
    }

    nbt_consume(&status_nbt, now_tick);

    pkt_status_t status_pkt;
    status_pkt.type = PKT_ID_STATUS;

    // Build status bitmask
    uint8_t status_bits = STATUS_BIT_INITIALIZED | STATUS_BIT_RASPI_POWER;
    if (chargecontrol_is_charging) {
      status_bits |= STATUS_BIT_CHARGING;
    }
    if (RAIN_Sense()) {
      status_bits |= STATUS_BIT_RAIN;
    }
    // Sound and UI availability from panel
    status_bits |= STATUS_BIT_UI_AVAIL;
    status_pkt.status_bitmask = status_bits;

    // USS ranges — fill from ultrasonic sensors
    for (unsigned int i = 0; i < MOWGLI_USS_COUNT; i++) {
      status_pkt.uss_ranges_m[i] = 0.0f;
    }
#if OPTION_ULTRASONIC == 1
    status_pkt.uss_ranges_m[0] =
        (float)(ULTRASONICSENSOR_u32GetLeftDistance()) / 10000.0f;
    status_pkt.uss_ranges_m[1] =
        (float)(ULTRASONICSENSOR_u32GetRightDistance()) / 10000.0f;
#endif

    // Emergency bitmask
    uint8_t emergency_bits = 0u;
    if (Emergency_State()) {
      emergency_bits |= EMERGENCY_BIT_LATCH;
      if (Emergency_StopButtonYellow() || Emergency_StopButtonWhite()) {
        emergency_bits |= EMERGENCY_BIT_STOP;
      }
      if (Emergency_WheelLiftBlue() || Emergency_WheelLiftRed()) {
        emergency_bits |= EMERGENCY_BIT_LIFT;
      }
    }
    status_pkt.emergency_bitmask = emergency_bits;

    // Power
    status_pkt.v_charge = charge_voltage;
    status_pkt.v_system = battery_voltage;
    status_pkt.charging_current = current;
    // No verified SoC source exists.  Keep the legacy byte for wire
    // compatibility; the ROS bridge publishes percentage as unknown (NaN),
    // not 0 %.  Do not infer SoC from voltage here.
    status_pkt.batt_percentage = 0;

    pkt_reset_cause_t reset_pkt;
    reset_pkt.type = PKT_ID_RESET_CAUSE;
    reset_pkt.reset_cause = g_boot_reset_cause_code;
    reset_pkt.last_stage_before_reset = g_boot_last_watchdog_stage_code;
    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_RESET_SEND);
    mowgli_comms_send(&reset_pkt, sizeof(reset_pkt));
    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_STATUS_SEND);
    mowgli_comms_send_status(&status_pkt);
    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_EXIT);
    return;
  }

